Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
/***************************************************
 Arduino TFT graphics library targeted at ESP8266
 and ESP32 based boards.

 This is a standalone library that contains the
 hardware driver. Graphics functions and
 proportional fonts moved to separated classes.

 Created by Bodmer 2/12/16

 Modifyed by Laguna_x 16/oct/2019
 ****************************************************/

#include "ESP32_SPIDisplay.h"

namespace Device {
namespace Display {
namespace {
inline void spi_begin(void) {
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(ESP32_PARALLEL)
	if (locked) {
		locked = false;
		spi.beginTransaction(
				SPISettings(SPI_FREQUENCY, MSBFIRST, TFT_SPI_MODE));
		CS_L
		;
	}
#else
				  CS_L;
				#endif
#ifdef ESP8266
				  SPI1U = SPI1U_WRITE;
				#endif
}

inline void spi_end(void) {
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(ESP32_PARALLEL)
	if (!inTransaction) {
		if (!locked) {
			locked = true;
			CS_H;
			spi.endTransaction();
		}
	}
#ifdef ESP8266
					SPI1U = SPI1U_READ;
				  #endif
#else
				  if(!inTransaction) CS_H;
				#endif
}

inline void spi_begin_read(void) {
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(ESP32_PARALLEL)
	if (locked) {
		locked = false;
		spi.beginTransaction(
				SPISettings(SPI_READ_FREQUENCY, MSBFIRST, TFT_SPI_MODE));
		CS_L
		;
	}
#else
				  #if !defined(ESP32_PARALLEL)
					spi.setFrequency(SPI_READ_FREQUENCY);
				  #endif
				   CS_L;
				#endif
#ifdef ESP8266
				  SPI1U = SPI1U_READ;
				#endif
}

inline void spi_end_read(void) {
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(ESP32_PARALLEL)
	if (!inTransaction) {
		if (!locked) {
			locked = true;
			CS_H;
			spi.endTransaction();
		}
	}
#else
				  #if !defined(ESP32_PARALLEL)
					spi.setFrequency(SPI_FREQUENCY);
				  #endif
				   if(!inTransaction) CS_H;
				#endif
#ifdef ESP8266
				  SPI1U = SPI1U_WRITE;
				#endif
}

}

uint8_t Screen::tabcolor, Screen::colstart, Screen::rowstart;

//Screen* Driver;

/*******************************************************************************
 *                                                                             *
 * Usage:                                                                      *
 *                                                                             *
 *  #include <ESP32-SPIDisplay.h>                                              *
 *                                                                             *
 *  Device::Display::init();                                                   *
 *   //or                                                                      *
 *  Device::Display::init(width, height);                                      *
 *   // where width and height are type of T_DispCoords                        *
 *                                                                             *
 *  Next where have needs use Driver as pointer to Screen class                *
 *                                                                             *
 *  To remove driver from memory call                                          *
 *  Device::Display::remove();                                                 *
 *                                                                             *
 *******************************************************************************/
//Screen* Driver;
// Next code for initializing class in memory
void init(T_DispCoords _W, T_DispCoords _H, uint8_t _R
#ifdef ST7735_DRIVER
 , uint8_t tc
 #endif
		) {
	Driver = new Screen(_W, _H);
#ifdef ST7735_DRIVER
 Driver->init(tc);
 #else
	Driver->init();
#endif
	Driver->setRotation(_R);
}
void init(uint8_t R
#ifdef ST7735_DRIVER
 , uint8_t tc
 #endif
		) {
	init((T_DispCoords)TFT_WIDTH,
	(T_DispCoords)TFT_HEIGHT, R
#ifdef ST7735_DRIVER
 , tc
 #endif
			);
}
void init(
#ifdef ST7735_DRIVER
 , uint8_t tc
 #endif
) {
	init((uint8_t) 0
#ifdef ST7735_DRIVER
 , tc
 #endif
			);
}
void remove() {
	delete (Driver);
}
// */
void Screen::PrintError(const char message[]) {
	//use it for debugging spi. Make print to serial or whatever.
	// Options defineing in "User_Settup_Select.h"
	#ifdef DEBUG_PRINT_SERIAL
		Serial.println(message);
	#endif
}

/***************************************************************************************
 ** Function name:           Screen
 ** Description:             Constructor , we must use hardware SPI pins
 ***************************************************************************************/
Screen::Screen(T_DispCoords w, T_DispCoords h) // @suppress("Class members should be properly initialized")
		{

	// The control pins are deliberately set to the inactive state (CS high) as setup()
	// might call and initialise other SPI peripherals which would could cause conflicts
	// if CS is floating or undefined.
#ifdef TFT_CS
	digitalWrite(TFT_CS, HIGH); // Chip select high (inactive)
	pinMode(TFT_CS, OUTPUT);
#endif

	// Configure chip select for touchscreen controller if present
#ifdef TOUCH_CS
	  digitalWrite(TOUCH_CS, HIGH); // Chip select high (inactive)
	  pinMode(TOUCH_CS, OUTPUT);
	#endif

#ifdef TFT_WR
	  digitalWrite(TFT_WR, HIGH); // Set write strobe high (inactive)
	  pinMode(TFT_WR, OUTPUT);
	#endif

#ifdef TFT_DC
	digitalWrite(TFT_DC, HIGH); // Data/Command high = data mode
	pinMode(TFT_DC, OUTPUT);
#endif

#ifdef TFT_RST
	if (TFT_RST >= 0) {
		digitalWrite(TFT_RST, HIGH); // Set high, do not share pin with another SPI device
		pinMode(TFT_RST, OUTPUT);
	}
#endif

#ifdef ESP32_PARALLEL

	  // Create a bit set lookup table for data bus - wastes 1kbyte of RAM but speeds things up dramatically
	  for (int32_t c = 0; c<256; c++)
	  {
	    xset_mask[c] = 0;
	    if ( c & 0x01 ) xset_mask[c] |= (1 << TFT_D0);
	    if ( c & 0x02 ) xset_mask[c] |= (1 << TFT_D1);
	    if ( c & 0x04 ) xset_mask[c] |= (1 << TFT_D2);
	    if ( c & 0x08 ) xset_mask[c] |= (1 << TFT_D3);
	    if ( c & 0x10 ) xset_mask[c] |= (1 << TFT_D4);
	    if ( c & 0x20 ) xset_mask[c] |= (1 << TFT_D5);
	    if ( c & 0x40 ) xset_mask[c] |= (1 << TFT_D6);
	    if ( c & 0x80 ) xset_mask[c] |= (1 << TFT_D7);
	  }

