Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
	  // Make sure read is high before we set the bus to output
	  digitalWrite(TFT_RD, HIGH);
	  pinMode(TFT_RD, OUTPUT);

	  GPIO.out_w1ts = set_mask(255); // Set data bus to 0xFF

	  // Set TFT data bus lines to output
	  busDir(dir_mask, OUTPUT);

	#endif

	_init_width = _width = w; // Set by specific xxxxx_Defines.h file or by users sketch
	_init_height = _height = h; // Set by specific xxxxx_Defines.h file or by users sketch
	rotation = 0;

	_swapBytes = true;   // Do not swap colour bytes by default

//	  locked = true;        // ESP32 transaction mutex lock flags
//	  inTransaction = false;

	_booted = true;

	addr_row = 0xFFFF;
	addr_col = 0xFFFF;

	cspinmask = 0;
	dcpinmask = 0;
	wrpinmask = 0;
	sclkpinmask = 0;

	lastColor = 0xFFFF;

}

Screen::~Screen() {

}
/***************************************************************************************
 ** Function name:           begin
 ** Description:             Included for backwards compatibility
 ***************************************************************************************/
void Screen::begin(uint8_t tc) {
	init(tc);
}

/***************************************************************************************
 ** Function name:           init (tc is tab color for ST7735 displays only)
 ** Description:             Reset, then initialise the TFT display registers
 ***************************************************************************************/
void Screen::init(uint8_t tc) {

	if (_booted) {
#if !defined (ESP32)
	  #if defined (TFT_CS) && (TFT_CS >= 0)
	    cspinmask = (uint32_t) digitalPinToBitMask(TFT_CS);
	  #endif

	  #if defined (TFT_DC) && (TFT_DC >= 0)
	    dcpinmask = (uint32_t) digitalPinToBitMask(TFT_DC);
	  #endif

	  #if defined (TFT_WR) && (TFT_WR >= 0)
	    wrpinmask = (uint32_t) digitalPinToBitMask(TFT_WR);
	  #endif

	  #if defined (TFT_SCLK) && (TFT_SCLK >= 0)
	    sclkpinmask = (uint32_t) digitalPinToBitMask(TFT_SCLK);
	  #endif

	  #ifdef TFT_SPI_OVERLAP
	    // Overlap mode SD0=MISO, SD1=MOSI, CLK=SCLK must use D3 as CS
	    //    pins(int8_t sck, int8_t miso, int8_t mosi, int8_t ss);
	    //spi.pins(        6,          7,           8,          0);
	    spi.pins(6, 7, 8, 0);
	  #endif

	  spi.begin(); // This will set HMISO to input

	#else
#if !defined(ESP32_PARALLEL)
#if defined (TFT_MOSI) && !defined (TFT_SPI_OVERLAP)
		spi.begin(TFT_SCLK, TFT_MISO, TFT_MOSI, -1);
#else
	      spi.begin();
	    #endif
#endif
#endif

		inTransaction = false;
		locked = true;

		// SUPPORT_TRANSACTIONS is mandatory for ESP32 so the hal mutex is toggled
		// so the code here is for ESP8266 only
#if !defined (SUPPORT_TRANSACTIONS) && defined (ESP8266)
	    spi.setBitOrder(MSBFIRST);
	    spi.setDataMode(TFT_SPI_MODE);
	    spi.setFrequency(SPI_FREQUENCY);
	#endif

#if defined(ESP32_PARALLEL)
	    digitalWrite(TFT_CS, LOW); // Chip select low permanently
	    pinMode(TFT_CS, OUTPUT);
	#else
#ifdef TFT_CS
		// Set to output once again in case D6 (MISO) is used for CS
		digitalWrite(TFT_CS, HIGH); // Chip select high (inactive)
		pinMode(TFT_CS, OUTPUT);
#else
	    spi.setHwCs(1); // Use hardware SS toggling
	  #endif
#endif

		// Set to output once again in case D6 (MISO) is used for DC
#ifdef TFT_DC
		digitalWrite(TFT_DC, HIGH); // Data/Command high = data mode
		pinMode(TFT_DC, OUTPUT);
#endif

		_booted = false;
		spi_end();
	} // end of: if just _booted

	// Toggle RST low to reset
	spi_begin();

#ifdef TFT_RST
	if (TFT_RST >= 0) {
		digitalWrite(TFT_RST, HIGH);
		delay(5);
		digitalWrite(TFT_RST, LOW);
		delay(20);
		digitalWrite(TFT_RST, HIGH);
	} else
		writecommand(TFT_SWRST); // Software reset
#else
	  writecommand(TFT_SWRST); // Software reset
	#endif

	spi_end();

	delay(150); // Wait for reset to complete

	spi_begin();

	// This loads the driver specific initialisation code  <<<<<<<<<<<<<<<<<<<<< ADD NEW DRIVERS TO THE LIST HERE <<<<<<<<<<<<<<<<<<<<<<<
#if   defined (ILI9341_DRIVER)
	    #include "TFT_Drivers/ILI9341_Init.h"

	#elif defined (ST7735_DRIVER)
	    tabcolor = tc;
	    #include "TFT_Drivers/ST7735_Init.h"

	#elif defined (ILI9163_DRIVER)
	    #include "TFT_Drivers/ILI9163_Init.h"

	#elif defined (S6D02A1_DRIVER)
	    #include "TFT_Drivers/S6D02A1_Init.h"

	#elif defined (RPI_ILI9486_DRIVER)
	    #include "TFT_Drivers/ILI9486_Init.h"

	#elif defined (ILI9486_DRIVER)
	    #include "TFT_Drivers/ILI9486_Init.h"

	#elif defined (ILI9481_DRIVER)
	    #include "TFT_Drivers/ILI9481_Init.h"

	#elif defined (ILI9488_DRIVER)
	    #include "TFT_Drivers/ILI9488_Init.h"

	#elif defined (HX8357D_DRIVER)
	    #include "TFT_Drivers/HX8357D_Init.h"

	#elif defined (ST7789_DRIVER)
#include "TFT_Drivers/ST7789_Init.h"

#elif defined (R61581_DRIVER)
	    #include "TFT_Drivers/R61581_Init.h"

	#elif defined (RM68140_DRIVER)
		#include "TFT_Drivers/RM68140_Init.h"

	#elif defined (ST7789_2_DRIVER)
	    #include "TFT_Drivers/ST7789_2_Init.h"

	#endif

#ifdef TFT_INVERSION_ON
	writecommand(TFT_INVON);
#endif

#ifdef TFT_INVERSION_OFF
	  writecommand(TFT_INVOFF);
	#endif

	spi_end();

	setRotation(rotation);

#if defined (TFT_BL) && defined (TFT_BACKLIGHT_ON)
	digitalWrite(TFT_BL, TFT_BACKLIGHT_ON);
	pinMode(TFT_BL, OUTPUT);
#else
	  #if defined (TFT_BL) && defined (M5STACK)
	    // Turn on the back-light LED
	    digitalWrite(TFT_BL, HIGH);
	    pinMode(TFT_BL, OUTPUT);
	  #endif
	#endif
}

/***************************************************************************************
 ** Function name:           setRotation
 ** Description:             rotate the screen orientation m = 0-3 or 4-7 for BMP drawing
 ***************************************************************************************/
void Screen::setRotation(uint8_t m) {

	//spi_begin();
	SPIStartWrite();

	// This loads the driver specific rotation code  <<<<<<<<<<<<<<<<<<<<< ADD NEW DRIVERS TO THE LIST HERE <<<<<<<<<<<<<<<<<<<<<<<
#if   defined (ILI9341_DRIVER)
	    #include "TFT_Drivers/ILI9341_Rotation.h"

	#elif defined (ST7735_DRIVER)
	    #include "TFT_Drivers/ST7735_Rotation.h"

