Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
	#elif defined (ILI9163_DRIVER)
	    #include "TFT_Drivers/ILI9163_Rotation.h"

	#elif defined (S6D02A1_DRIVER)
	    #include "TFT_Drivers/S6D02A1_Rotation.h"

	#elif defined (RPI_ILI9486_DRIVER)
	    #include "TFT_Drivers/ILI9486_Rotation.h"

	#elif defined (ILI9486_DRIVER)
	    #include "TFT_Drivers/ILI9486_Rotation.h"

	#elif defined (ILI9481_DRIVER)
	    #include "TFT_Drivers/ILI9481_Rotation.h"

	#elif defined (ILI9488_DRIVER)
	    #include "TFT_Drivers/ILI9488_Rotation.h"

	#elif defined (HX8357D_DRIVER)
	    #include "TFT_Drivers/HX8357D_Rotation.h"

	#elif defined (ST7789_DRIVER)
#include "TFT_Drivers/ST7789_Rotation.h"

#elif defined (R61581_DRIVER)
	    #include "TFT_Drivers/R61581_Rotation.h"

	#elif defined (RM68140_DRIVER)
		#include "TFT_Drivers/RM68140_Rotation.h"

	#elif defined (ST7789_2_DRIVER)
	    #include "TFT_Drivers/ST7789_2_Rotation.h"

	#endif

	delayMicroseconds(10);

	//spi_end();
	SPIEndWrite();

	addr_row = 0xFFFF;
	addr_col = 0xFFFF;
}

/***************************************************************************************
 ** Function name:           commandList, used for FLASH based lists only (e.g. ST7735)
 ** Description:             Get initialisation commands from FLASH and send to TFT
 ***************************************************************************************/
void Screen::commandList(const uint8_t *addr) {
	uint8_t numCommands;
	uint8_t numArgs;
	uint8_t ms;

	numCommands = pgm_read_byte(addr++);   // Number of commands to follow

	while (numCommands--)                  // For each command...
	{
		writecommand(pgm_read_byte(addr++)); // Read, issue command
		numArgs = pgm_read_byte(addr++);     // Number of args to follow
		ms = numArgs & TFT_INIT_DELAY;       // If hibit set, delay follows args
		numArgs &= ~TFT_INIT_DELAY;          // Mask out delay bit

		while (numArgs--)                    // For each argument...
		{
			writedata(pgm_read_byte(addr++));  // Read, issue argument
		}

		if (ms) {
			ms = pgm_read_byte(addr++);     // Read post-command delay time (ms)
			delay((ms == 255 ? 500 : ms));
		}
	}
}

/***************************************************************************************
 ** Function name:           spiwrite
 ** Description:             Write 8 bits to SPI port (legacy support only)
 ***************************************************************************************/
void Screen::spiwrite(uint8_t c) {
	tft_Write_8(c);
}

/***************************************************************************************
 ** Function name:           writecommand
 ** Description:             Send an 8 bit command to the TFT
 ***************************************************************************************/
void Screen::writecommand(uint8_t c) {
	spi_begin(); // CS_L;

	DC_C;

	tft_Write_8(c);

	DC_D;

	spi_end();  // CS_H;

}

/***************************************************************************************
 ** Function name:           writedata
 ** Description:             Send a 8 bit data value to the TFT
 ***************************************************************************************/
void Screen::writedata(uint8_t d) {
	spi_begin(); // CS_L;

	DC_D;        // Play safe, but should already be in data mode

	tft_Write_8(d);

	CS_L
	;        // Allow more hold time for low VDI rail

	spi_end();   // CS_H;
}

/***************************************************************************************
 ** Function name:           readcommand8
 ** Description:             Read a 8 bit data value from an indexed command register
 ***************************************************************************************/
uint8_t Screen::readcommand8(uint8_t cmd_function, uint8_t index) {
	uint8_t reg = 0;
#ifdef ESP32_PARALLEL

	  writecommand(cmd_function); // Sets DC and CS high

	  busDir(dir_mask, INPUT);

	  CS_L;

	  // Read nth parameter (assumes caller discards 1st parameter or points index to 2nd)
	  while(index--) reg = readByte();

	  busDir(dir_mask, OUTPUT);

	  CS_H;

	#else
	// for ILI9341 Interface II i.e. IM [3:0] = "1101"
	spi_begin_read();
	index = 0x10 + (index & 0x0F);

	DC_C;
	tft_Write_8(0xD9);
	DC_D;
	tft_Write_8(index);

	CS_H; // Some displays seem to need CS to be pulsed here, or is just a delay needed?
	CS_L
	;

	DC_C;
	tft_Write_8(cmd_function);
	DC_D;
	reg = tft_Read_8();

	spi_end_read();
#endif
	return reg;
}

/***************************************************************************************
 ** Function name:           readcommand16
 ** Description:             Read a 16 bit data value from an indexed command register
 ***************************************************************************************/
uint16_t Screen::readcommand16(uint8_t cmd_function, uint8_t index) {
	uint32_t reg;

	reg = (readcommand8(cmd_function, index + 0) << 8);
	reg |= (readcommand8(cmd_function, index + 1) << 0);

	return reg;
}

/***************************************************************************************
 ** Function name:           readcommand32
 ** Description:             Read a 32 bit data value from an indexed command register
 ***************************************************************************************/
uint32_t Screen::readcommand32(uint8_t cmd_function, uint8_t index) {
	uint32_t reg;

	reg = (readcommand8(cmd_function, index + 0) << 24);
	reg |= (readcommand8(cmd_function, index + 1) << 16);
	reg |= (readcommand8(cmd_function, index + 2) << 8);
	reg |= (readcommand8(cmd_function, index + 3) << 0);

	return reg;
}

/***************************************************************************************
 ** Function name:           read pixel (for SPI Interface II i.e. IM [3:0] = "1101")
 ** Description:             Read 565 pixel colors from a pixel
 ***************************************************************************************/
uint32_t Screen::readPixel(T_DispCoords x0, T_DispCoords y0) {
#if defined(ESP32_PARALLEL)

  readAddrWindow(x0, y0, 1, 1); // Sets CS low

