Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
  // Set masked pins D0- D7 to input
  busDir(dir_mask, INPUT);

  // Dummy read to throw away don't care value
  readByte();

  // Fetch the 16 bit BRG pixel
  //uint16_t rgb = (readByte() << 8) | readByte();

  #if defined (ILI9341_DRIVER) | defined (ILI9488_DRIVER) // Read 3 bytes

  // Read window pixel 24 bit RGB values and fill in LS bits
  uint16_t rgb = ((readByte() & 0xF8) << 8) | ((readByte() & 0xFC) << 3) | (readByte() >> 3);

  CS_H;

  // Set masked pins D0- D7 to output
  busDir(dir_mask, OUTPUT);

  return rgb;

  #else // ILI9481 16 bit read

  // Fetch the 16 bit BRG pixel
  uint16_t bgr = (readByte() << 8) | readByte();

  CS_H;

  // Set masked pins D0- D7 to output
  busDir(dir_mask, OUTPUT);

  // Swap Red and Blue (could check MADCTL setting to see if this is needed)
  return  (bgr>>11) | (bgr<<11) | (bgr & 0x7E0);
  #endif

#else // Not ESP32_PARALLEL

	spi_begin_read();

	readAddrWindow(x0, y0, 1, 1); // Sets CS low

#ifdef TFT_SDA_READ
    begin_SDA_Read();
  #endif

	// Dummy read to throw away don't care value
	tft_Read_8();

	//#if !defined (ILI9488_DRIVER)

	// Read the 3 RGB bytes, colour is actually only in the top 6 bits of each byte
	// as the TFT stores colours as 18 bits
	uint8_t r = tft_Read_8();
	uint8_t g = tft_Read_8();
	uint8_t b = tft_Read_8();
	/*
	 #else

	 // The 6 colour bits are in MS 6 bits of each byte, but the ILI9488 needs an extra clock pulse
	 // so bits appear shifted right 1 bit, so mask the middle 6 bits then shift 1 place left
	 uint8_t r = (tft_Read_8()&0x7E)<<1;
	 uint8_t g = (tft_Read_8()&0x7E)<<1;
	 uint8_t b = (tft_Read_8()&0x7E)<<1;

	 #endif
	 */
	CS_H;

#ifdef TFT_SDA_READ
    end_SDA_Read();
  #endif

	spi_end_read();

	return (((uint32_t) 0) | (r << 16) | (g << 8) | b); //retuns 0x00rrggbb;color565(r, g, b);

#endif
}

#ifdef ESP32_PARALLEL
		/***************************************************************************************
		** Function name:           read byte  - supports class functions
		** Description:             Read a byte from ESP32 8 bit data port
		***************************************************************************************/
		// Bus MUST be set to input before calling this function!
		uint8_t Screen::readByte(void)
		{
		  uint8_t b = 0;

		  RD_L;
		  uint32_t reg;           // Read all GPIO pins 0-31
		  reg = gpio_input_get(); // Read three times to allow for bus access time
		  reg = gpio_input_get();
		  reg = gpio_input_get(); // Data should be stable now
		  RD_H;

		  // Check GPIO bits used and build value
		  b  = (((reg>>TFT_D0)&1) << 0);
		  b |= (((reg>>TFT_D1)&1) << 1);
		  b |= (((reg>>TFT_D2)&1) << 2);
		  b |= (((reg>>TFT_D3)&1) << 3);
		  b |= (((reg>>TFT_D4)&1) << 4);
		  b |= (((reg>>TFT_D5)&1) << 5);
		  b |= (((reg>>TFT_D6)&1) << 6);
		  b |= (((reg>>TFT_D7)&1) << 7);

		  return b;
		}
		#endif

/***************************************************************************************
 ** Function name:           masked GPIO direction control  - supports class functions
 ** Description:             Set masked ESP32 GPIO pins to input or output
 ***************************************************************************************/
#ifdef ESP32_PARALLEL
		void Screen::busDir(uint32_t mask, uint8_t mode)
		{
		#ifdef ESP32_PARALLEL

		  // Supports GPIO 0 - 31 on ESP32 only
		  gpio_config_t gpio;

		  gpio.pin_bit_mask = mask;
		  gpio.mode         = GPIO_MODE_INPUT;
		  gpio.pull_up_en   = GPIO_PULLUP_ENABLE;
		  gpio.pull_down_en = GPIO_PULLDOWN_DISABLE;
		  gpio.intr_type    = GPIO_INTR_DISABLE;

		  if (mode == OUTPUT) gpio.mode = GPIO_MODE_OUTPUT;

		  gpio_config(&gpio);

		#endif
		}
#endif

/***************************************************************************************
 ** Function name:           read rectangle (for SPI Interface II i.e. IM [3:0] = "1101")
 ** Description:             Read 565 pixel colors from a defined area
 ***************************************************************************************/
void Screen::readRect(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data) {
	if ((x > _width) || (y > _height) || (w == 0) || (h == 0))
		return;

#if defined(ESP32_PARALLEL)

		  readAddrWindow(x, y, w, h); // Sets CS low

		  // Set masked pins D0- D7 to input
		  busDir(dir_mask, INPUT);

		  // Dummy read to throw away don't care value
		  readByte();

		  // Total pixel count
		  uint32_t len = w * h;

		#if defined (ILI9341_DRIVER) | defined (ILI9488_DRIVER) // Read 3 bytes
		  // Fetch the 24 bit RGB value
		  while (len--) {
			// Assemble the RGB 16 bit color
			uint16_t rgb = ((readByte() & 0xF8) << 8) | ((readByte() & 0xFC) << 3) | (readByte() >> 3);

			// Swapped byte order for compatibility with pushRect()
			*data++ = (rgb<<8) | (rgb>>8);
		  }
		#else // ILI9481 reads as 16 bits
		  // Fetch the 16 bit BRG pixels
		  while (len--) {
			// Read the BRG 16 bit color
			uint16_t bgr = (readByte() << 8) | readByte();

			// Swap Red and Blue (could check MADCTL setting to see if this is needed)
			uint16_t rgb = (bgr>>11) | (bgr<<11) | (bgr & 0x7E0);

			// Swapped byte order for compatibility with pushRect()
			*data++ = (rgb<<8) | (rgb>>8);
		  }
		#endif
		  CS_H;

		  // Set masked pins D0- D7 to output
		  busDir(dir_mask, OUTPUT);

		#else // Not ESP32_PARALLEL

	//spi_begin_read();
	if (SPIStartRead()) {

	readAddrWindow(x, y, w, h); // Sets CS low

#ifdef TFT_SDA_READ
			begin_SDA_Read();
		  #endif

	// Dummy read to throw away don't care value
	tft_Read_8();

	// Read window pixel 24 bit RGB values
	uint32_t len = w * h;
	while (len--) {

#if !defined (ILI9488_DRIVER)

		// Read the 3 RGB bytes, color is actually only in the top 6 bits of each byte
		// as the TFT stores colors as 18 bits
		uint8_t r = tft_Read_8();
		uint8_t g = tft_Read_8();
		uint8_t b = tft_Read_8();

#else

			// The 6 color bits are in LS 6 bits of each byte but we do not include the extra clock pulse
			// so we use a trick and mask the middle 6 bits of the byte, then only shift 1 place left
			uint8_t r = (tft_Read_8()&0x7E)<<1;
			uint8_t g = (tft_Read_8()&0x7E)<<1;
			uint8_t b = (tft_Read_8()&0x7E)<<1;

		  #endif

		// Swapped color byte order for compatibility with pushRect()
		*data++ = (r & 0xF8) | (g & 0xE0) >> 5 | (b & 0xF8) << 5
				| (g & 0x1C) << 11;
	}

