Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
	CS_H;

#ifdef TFT_SDA_READ
			end_SDA_Read();
		  #endif

		SPIEndRead();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}
//	spi_end_read();

#endif
}

/***************************************************************************************
 ** Function name:           tft_Read_8
 ** Description:             Software SPI to read bidirectional SDA line
 ***************************************************************************************/
#if defined (ESP8266) && defined (TFT_SDA_READ)
		uint8_t Screen::tft_Read_8(void)
		{
		  uint8_t  ret = 0;
		  uint32_t reg = 0;

		  for (uint8_t i = 0; i < 8; i++) {  // read results
			ret <<= 1;
			SCLK_L;
			if (digitalRead(TFT_MOSI)) ret |= 1;
			SCLK_H;
		  }

		  return ret;
		}
		#endif

/***************************************************************************************
 ** Function name:           beginSDA
 ** Description:             Detach SPI from pin to permit software SPI
 ***************************************************************************************/
#ifdef TFT_SDA_READ
		void Screen::begin_SDA_Read(void)
		{
		  #ifdef ESP32
			pinMatrixOutDetach(TFT_MOSI, false, false);
			pinMode(TFT_MOSI, INPUT);
			pinMatrixInAttach(TFT_MOSI, VSPIQ_IN_IDX, false);
		  #else // ESP8266
			#ifdef TFT_SPI_OVERLAP
			  // Reads in overlap mode not supported
			#else
			  spi.end();
			#endif
		  #endif
		}
		#endif

/***************************************************************************************
 ** Function name:           endSDA
 ** Description:             Attach SPI pins after software SPI
 ***************************************************************************************/
#ifdef TFT_SDA_READ
		void Screen::end_SDA_Read(void)
		{
		  #ifdef ESP32
			pinMode(TFT_MOSI, OUTPUT);
			pinMatrixOutAttach(TFT_MOSI, VSPID_OUT_IDX, false, false);
			pinMode(TFT_MISO, INPUT);
			pinMatrixInAttach(TFT_MISO, VSPIQ_IN_IDX, false);
		  #else
			#ifdef TFT_SPI_OVERLAP
			  spi.pins(6, 7, 8, 0);
			#else
			  spi.begin();
			#endif
		  #endif
		}
		#endif

/***************************************************************************************
 ** Function name:           push rectangle (for SPI Interface II i.e. IM [3:0] = "1101")
 ** Description:             push 565 pixel colors into a defined area
 ***************************************************************************************/
void Screen::pushRect(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data) {
	// Function deprecated, remains for backwards compatibility
	// pushImage() is better as it will crop partly off-screen image blocks
	pushImage(x, y, w, h, data);
}

/***************************************************************************************
 ** Function name:           pushImage
 ** Description:             plot 16 bit color sprite or image onto TFT
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data) {

	if ((x >= _width) || (y >= _height))
		return;

	int32_t dx = 0;
	int32_t dy = 0;
	int32_t dw = w;
	int32_t dh = h;

	if (x < 0) {
		dw += x;
		dx = -x;
		x = 0;
	}
	if (y < 0) {
		dh += y;
		dy = -y;
		y = 0;
	}

	if ((x + w) > _width)
		dw = _width - x;
	if ((y + h) > _height)
		dh = _height - y;

	if (dw < 1 || dh < 1)
		return;
	if (SPIStartWrite()) {
		setWindow(x, y, x + dw - 1, y + dh - 1);

		data += dx + dy * w;

		while (dh--) {
			pushColors(data, dw, _swapBytes);
			data += w;
		}
		SPIEndWrite();
	} else {
		//calling output: Error, SPI is buisy!
		PrintError("[pushImage] Error: SPI is buisy");
	}
}

/***************************************************************************************
 ** Function name:           pushImage
 ** Description:             plot 16 bit sprite or image with 1 color being transparent
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data, uint16_t transp) {

	if ((x >= _width) || (y >= _height))
		return;

	int32_t dx = 0;
	int32_t dy = 0;
	int32_t dw = w;
	int32_t dh = h;

	if (x < 0) {
		dw += x;
		dx = -x;
		x = 0;
	}
	if (y < 0) {
		dh += y;
		dy = -y;
		y = 0;
	}

	if ((x + w) > _width)
		dw = _width - x;
	if ((y + h) > _height)
		dh = _height - y;

	if (dw < 1 || dh < 1)
		return;

	if (SPIStartWrite()) {
		data += dx + dy * w;

		int32_t xe = x + dw - 1, ye = y + dh - 1;

		uint16_t lineBuf[dw];

		if (!_swapBytes)
			transp = transp >> 8 | transp << 8;

		while (dh--) {
			int32_t len = dw;
			uint16_t *ptr = data;
			int32_t px = x;
			boolean move = true;
			uint16_t np = 0;

			while (len--) {
				if (transp != *ptr) {
					if (move) {
						move = false;
						setWindow(px, y, xe, ye);
					}
					lineBuf[np] = *ptr;
					np++;
				} else {
					move = true;
					if (np) {
						pushColors((uint16_t*) lineBuf, np, _swapBytes);
						np = 0;
					}
				}
				px++;
				ptr++;
			}
			if (np)
				pushColors((uint16_t*) lineBuf, np, _swapBytes);

			y++;
			data += w;
		}
		SPIEndWrite();
	} else {
		PrintError("[pushImage]Error: SPI is buisy!");
	}
}

/***************************************************************************************
 ** Function name:           pushImage
 ** Description:             plot 16 bit sprite or image with alpha data
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data, uint8_t *alpha) {

	if ((x >= _width) || (y >= _height))
		return;

	int32_t dx = 0;
	int32_t dy = 0;
	int32_t dw = w;
	int32_t dh = h;

	if (x < 0) {
		dw += x;
		dx = -x;
		x = 0;
	}
	if (y < 0) {
		dh += y;
		dy = -y;
		y = 0;
	}

	if ((x + w) > _width)
		dw = _width - x;
	if ((y + h) > _height)
		dh = _height - y;

	if (dw < 1 || dh < 1)
		return;

	if (SPIStartWrite()) {
		data += dx + dy * w;

		int32_t xe = x + dw - 1, ye = y + dh - 1;

