Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
	if (SPIStartRead()) {
		//spi_begin_read();

		readAddrWindow(x0, y0, w, h); // Sets CS low

#ifdef TFT_SDA_READ
			begin_SDA_Read();
		  #endif

		// Dummy read to throw away don't care value
		tft_Read_8();

		// Read window pixel 24 bit RGB values, buffer must be set in sketch to 3 * w * h
		uint32_t len = w * h;
		while (len--) {

#if !defined (ILI9488_DRIVER)

			// Read the 3 RGB bytes, color is actually only in the top 6 bits of each byte
			// as the TFT stores colors as 18 bits
			*data++ = tft_Read_8();
			*data++ = tft_Read_8();
			*data++ = tft_Read_8();

#else

			// The 6 color bits are in MS 6 bits of each byte, but the ILI9488 needs an extra clock pulse
			// so bits appear shifted right 1 bit, so mask the middle 6 bits then shift 1 place left
			*data++ = (tft_Read_8()&0x7E)<<1;
			*data++ = (tft_Read_8()&0x7E)<<1;
			*data++ = (tft_Read_8()&0x7E)<<1;

		  #endif

		}

		CS_H;

#ifdef TFT_SDA_READ
			end_SDA_Read();
		  #endif

		SPIEndRead();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}
	//spi_end_read();

#endif
}

/***************************************************************************************
 ** Function name:           getRotation
 ** Description:             Return the rotation value (as used by setRotation())
 ***************************************************************************************/
uint8_t Screen::getRotation(void) {
	return rotation;
}

/***************************************************************************************
 ** Function name:           width
 ** Description:             Return the pixel width of display (per current rotation)
 ***************************************************************************************/
// Return the size of the display (per current rotation)
T_DispCoords Screen::width(void) {
	return _width;
}

/***************************************************************************************
 ** Function name:           height
 ** Description:             Return the pixel height of display (per current rotation)
 ***************************************************************************************/
T_DispCoords Screen::height(void) {
	return _height;
}

/***************************************************************************************
 ** Function name:           setAddrWindow
 ** Description:             define an area to receive a stream of pixels
 ***************************************************************************************/
// Chip select is high at the end of this function
void Screen::setAddrWindow(T_DispCoords x0, T_DispCoords y0, T_DispCoords w,
		T_DispCoords h) {
	if (SPIStartWrite()) {
		setWindow(x0, y0, x0 + w - 1, y0 + h - 1);
		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}
}

/***************************************************************************************
 ** Function name:           setWindow
 ** Description:             define an area to receive a stream of pixels
 ** spi_begin(); - Must be called before setWimdow
 ***************************************************************************************/
// Chip select stays low, call spi_begin first. Use setAddrWindow() from sketches
#if defined (ESP8266) && !defined (RPI_WRITE_STROBE) && !defined (RPI_ILI9486_DRIVER)
		void Screen::setWindow(int32_t xs, int32_t ys, int32_t xe, int32_t ye)
		{
		#ifdef CGRAM_OFFSET
		  xs+=colstart;
		  xe+=colstart;
		  ys+=rowstart;
		  ye+=rowstart;
		#endif

		  // Column addr set
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  SPI1W0 = TFT_CASET;
		  SPI1CMD |= SPIBUSY;

		  addr_col = 0xFFFF;
		  addr_row = 0xFFFF;

		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  SPI1U1 = (31 << SPILMOSI) | (31 << SPILMISO);
		  // Load the two coords as a 32 bit value and shift in one go
		  SPI1W0 = (xs >> 8) | (uint16_t)(xs << 8) | ((uint8_t)(xe >> 8)<<16 | (xe << 24));
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  // Row addr set
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  SPI1W0 = TFT_PASET;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  SPI1U1 = (31 << SPILMOSI) | (31 << SPILMISO);
		  // Load the two coords as a 32 bit value and shift in one go
		  SPI1W0 = (ys >> 8) | (uint16_t)(ys << 8) | ((uint8_t)(ye >> 8)<<16 | (ye << 24));
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  // write to RAM
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);
		  SPI1W0 = TFT_RAMWR;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  SPI1U1 = (15 << SPILMOSI) | (15 << SPILMISO);
		}

		#elif defined (ESP8266) && !defined (RPI_WRITE_STROBE) && defined (RPI_ILI9486_DRIVER) // This is for the RPi display that needs 16 bits

		void Screen::setWindow(int32_t xs, int32_t ys, int32_t xe, int32_t ye)
		{

		  addr_col = 0xFFFF;
		  addr_row = 0xFFFF;

		  // Column addr set
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  SPI1W0 = TFT_CASET<<8;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  uint8_t xb[] = { 0, (uint8_t) (xs>>8), 0, (uint8_t) (xs>>0), 0, (uint8_t) (xe>>8), 0, (uint8_t) (xe>>0), };
		  spi.writePattern(&xb[0], 8, 1);

		  // Row addr set
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  SPI1W0 = TFT_PASET<<8;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  uint8_t yb[] = { 0, (uint8_t) (ys>>8), 0, (uint8_t) (ys>>0), 0, (uint8_t) (ye>>8), 0, (uint8_t) (ye>>0), };
		  spi.writePattern(&yb[0], 8, 1);

		  // write to RAM
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);
		  SPI1W0 = TFT_RAMWR<<8;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  // Re-instate SPI flags settings corrupted by SPI library writePattern() call
		  SPI1U = SPI1U_WRITE;

		}

		#else

#if defined (ESP8266) && defined (RPI_ILI9486_DRIVER) // This is for the RPi display that needs 16 bits
		void Screen::setWindow(T_DispCoords x0, T_DispCoords y0, T_DispCoords x1, T_DispCoords y1)
		{

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  // Column addr set
		  DC_C;

		  SPI1W0 = TFT_CASET<<(CMD_BITS + 1 - 8);
		  SPI1CMD |= SPIBUSY;
		  addr_col = 0xFFFF; // Use the waiting time to do something useful
		  addr_row = 0xFFFF;
		  while(SPI1CMD & SPIBUSY) {}
		  DC_D;

		  SPI1W0 = x0 >> 0;
		  SPI1CMD |= SPIBUSY;
		  x0 = x0 << 8; // Use the waiting time to do something useful
		  while(SPI1CMD & SPIBUSY) {}

		  SPI1W0 = x0;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  SPI1W0 = x1 >> 0;
		  SPI1CMD |= SPIBUSY;
		  x1 = x1 << 8; // Use the waiting time to do something useful
		  while(SPI1CMD & SPIBUSY) {}

