Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
		  SPI1W0 = x1;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  // Row addr set
		  DC_C;

		  SPI1W0 = TFT_PASET<<(CMD_BITS + 1 - 8);
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}
		  DC_D;

		  SPI1W0 = y0 >> 0;
		  SPI1CMD |= SPIBUSY;
		  y0 = y0 << 8; // Use the waiting time to do something useful
		  while(SPI1CMD & SPIBUSY) {}

		  SPI1W0 = y0;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  SPI1W0 = y1 >> 0;
		  SPI1CMD |= SPIBUSY;
		  y1 = y1 << 8; // Use the waiting time to do something useful
		  while(SPI1CMD & SPIBUSY) {}

		  SPI1W0 = y1;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  // write to RAM
		  DC_C;

		  SPI1W0 = TFT_RAMWR<<(CMD_BITS + 1 - 8);
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		}

		#else // This is for the ESP32

void Screen::setWindow(T_DispCoords x0, T_DispCoords y0, T_DispCoords x1,
		T_DispCoords y1) {

	addr_col = 0xFFFF;
	addr_row = 0xFFFF;

#ifdef CGRAM_OFFSET
	x0 += colstart;
	x1 += colstart;
	y0 += rowstart;
	y1 += rowstart;
#endif

	DC_C;

	tft_Write_8(TFT_CASET);

	DC_D;

#if defined (RPI_ILI9486_DRIVER)
		  uint8_t xb[] = { 0, (uint8_t) (x0>>8), 0, (uint8_t) (x0>>0), 0, (uint8_t) (x1>>8), 0, (uint8_t) (x1>>0), };
		  spi.writePattern(&xb[0], 8, 1);
		#else
	tft_Write_32(SPI_32(x0, x1));
#endif

	DC_C;

	// Row addr set
	tft_Write_8(TFT_PASET);

	DC_D;

#if defined (RPI_ILI9486_DRIVER)
		  uint8_t yb[] = { 0, (uint8_t) (y0>>8), 0, (uint8_t) (y0>>0), 0, (uint8_t) (y1>>8), 0, (uint8_t) (y1>>0), };
		  spi.writePattern(&yb[0], 8, 1);
		#else
	tft_Write_32(SPI_32(y0, y1));
#endif

	DC_C;

	// write to RAM
	tft_Write_8(TFT_RAMWR);

	DC_D;

}
#endif // end RPI_ILI9486_DRIVER check
#endif // end ESP32 check

/***************************************************************************************
 ** Function name:           readAddrWindow
 ** Description:             define an area to read a stream of pixels
 ***************************************************************************************/
// Chip select stays low
#if defined (ESP8266) && !defined (RPI_WRITE_STROBE)
		void Screen::readAddrWindow(int32_t xs, int32_t ys, T_DispCoords w, T_DispCoords h)
		{

		  int32_t xe = xs + w - 1;
		  int32_t ye = ys + h - 1;

		  addr_col = 0xFFFF;
		  addr_row = 0xFFFF;

		#ifdef CGRAM_OFFSET
		  xs += colstart;
		  xe += colstart;
		  ys += rowstart;
		  ye += rowstart;
		#endif

		  // Column addr set
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  SPI1W0 = TFT_CASET;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  SPI1U1 = (31 << SPILMOSI) | (31 << SPILMISO);
		  // Load the two coords as a 32 bit value and shift in one go
		  SPI1W0 = (xs >> 8) | (uint16_t)(xs << 8) | ((uint8_t)(xe >> 8)<<16 | (xe << 24));
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  // Row addr set
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  SPI1W0 = TFT_PASET;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  SPI1U1 = (31 << SPILMOSI) | (31 << SPILMISO);
		  // Load the two coords as a 32 bit value and shift in one go
		  SPI1W0 = (ys >> 8) | (uint16_t)(ys << 8) | ((uint8_t)(ye >> 8)<<16 | (ye << 24));
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  // read from RAM
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);
		  SPI1W0 = TFT_RAMRD;
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		}

		#else //ESP32

void Screen::readAddrWindow(int32_t xs, int32_t ys, T_DispCoords w,
		T_DispCoords h) {

	int32_t xe = xs + w - 1;
	int32_t ye = ys + h - 1;

	addr_col = 0xFFFF;
	addr_row = 0xFFFF;

#ifdef CGRAM_OFFSET
	xs += colstart;
	xe += colstart;
	ys += rowstart;
	ye += rowstart;
#endif

	// Column addr set
	DC_C;

	tft_Write_8(TFT_CASET);

	DC_D;

	tft_Write_32(SPI_32(xs, xe));

	// Row addr set
	DC_C;

	tft_Write_8(TFT_PASET);

	DC_D;

	tft_Write_32(SPI_32(ys, ye));

	DC_C;

	tft_Write_8(TFT_RAMRD); // Read CGRAM command

	DC_D;

}

#endif

/***************************************************************************************
 ** Function name:           drawPixel
 ** Description:             push a single pixel at an arbitrary position
 ***************************************************************************************/
#if defined (ESP8266) && !defined (RPI_WRITE_STROBE)
		void Screen::drawPixel(T_DispCoords x, T_DispCoords y, uint32_t color)
		{
		  // Range checking
		  if ((x < 0) || (y < 0) ||(x >= _width) || (y >= _height)) return;

		#ifdef CGRAM_OFFSET
		  x+=colstart;
		  y+=rowstart;
		#endif

		if(SPIStartWrite()){

		  // No need to send x if it has not changed (speeds things up)
		  if (addr_col != x) {

			DC_C;

			SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);
			SPI1W0 = TFT_CASET<<(CMD_BITS + 1 - 8);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			DC_D;

		#if defined (RPI_ILI9486_DRIVER) // This is for the RPi display that needs 16 bits per byte
			uint8_t cBin[] = { 0, (uint8_t) (x>>8), 0, (uint8_t) (x>>0)};
			spi.writePattern(&cBin[0], 4, 2);
		#else
			SPI1U1 = (31 << SPILMOSI) | (31 << SPILMISO);
			// Load the two coords as a 32 bit value and shift in one go
			uint32_t xswap = (x >> 8) | (uint16_t)(x << 8);
			SPI1W0 = xswap | (xswap << 16);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
		#endif

			addr_col = x;
		  }

		  // No need to send y if it has not changed (speeds things up)
		  if (addr_row != y) {

			DC_C;

			SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

			SPI1W0 = TFT_PASET<<(CMD_BITS + 1 - 8);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			DC_D;

		#if defined (RPI_ILI9486_DRIVER) // This is for the RPi display that needs 16 bits per byte
			uint8_t cBin[] = { 0, (uint8_t) (y>>8), 0, (uint8_t) (y>>0)};
			spi.writePattern(&cBin[0], 4, 2);
		#else
			SPI1U1 = (31 << SPILMOSI) | (31 << SPILMISO);
			// Load the two coords as a 32 bit value and shift in one go
			uint32_t yswap = (y >> 8) | (uint16_t)(y << 8);
			SPI1W0 = yswap | (yswap << 16);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
		#endif

			addr_row = y;
		  }

