Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
		  DC_C;

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);

		  SPI1W0 = TFT_RAMWR<<(CMD_BITS + 1 - 8);
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		#if  defined (ILI9488_DRIVER)
		  tft_Write_16(color);
		#else
		  SPI1U1 = (15 << SPILMOSI) | (15 << SPILMISO);

		  SPI1W0 = (color >> 8) | (color << 8);
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}
		#endif

		  SPIEndWrite();
			}else{
				PrintError("[]Error: SPI is buisy!");
			}
		}

		#else

#if defined (ESP8266) && defined (RPI_ILI9486_DRIVER) // This is for the RPi display that needs 16 bits

		void Screen::drawPixel(T_DispCoords x, T_DispCoords y, uint32_t color)
		{
		  // Range checking
		  if ((x < 0) || (y < 0) ||(x >= _width) || (y >= _height)) return;

		  if(SPIStartWrite()){

		  SPI1U1 = (CMD_BITS << SPILMOSI) | (CMD_BITS << SPILMISO);
		  // No need to send x if it has not changed (speeds things up)
		  if (addr_col != x) {
			DC_C;

			SPI1W0 = TFT_CASET<<(CMD_BITS + 1 - 8);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
			DC_D;

			SPI1W0 = x >> 0;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			SPI1W0 = x << 8;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			SPI1W0 = x >> 0;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			SPI1W0 = x << 8;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			addr_col = x;
		  }

		  // No need to send y if it has not changed (speeds things up)
		  if (addr_row != y) {
			DC_C;

			SPI1W0 = TFT_PASET<<(CMD_BITS + 1 - 8);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
			DC_D;

			SPI1W0 = y >> 0;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			SPI1W0 = y << 8;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			SPI1W0 = y >> 0;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			SPI1W0 = y << 8;
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}

			addr_row = y;
		  }

		  DC_C;

		  SPI1W0 = TFT_RAMWR<<(CMD_BITS + 1 - 8);
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  DC_D;

		  SPI1W0 = (color >> 8) | (color << 8);
		  SPI1CMD |= SPIBUSY;
		  while(SPI1CMD & SPIBUSY) {}

		  SPIEndWrite();
			}else{
				PrintError("[]Error: SPI is buisy!");
			}
		}

		#else // ESP32

void Screen::drawPixel(T_DispCoords x, T_DispCoords y, uint32_t color) {
	// Range checking
	if ((x < 0) || (y < 0) || (x >= _width) || (y >= _height))
		return;

//	if (SPIStartWrite()) {
	spi_begin();

#ifdef CGRAM_OFFSET
	x += colstart;
	y += rowstart;
#endif

	DC_C;

	// No need to send x if it has not changed (speeds things up)
	if (addr_col != x) {

		tft_Write_8(TFT_CASET);

		DC_D;

#if defined (RPI_ILI9486_DRIVER)
			uint8_t xb[] = { 0, (uint8_t) (x>>8), 0, (uint8_t) (x>>0), 0, (uint8_t) (x>>8), 0, (uint8_t) (x>>0), };
			spi.writePattern(&xb[0], 8, 1);
		#else
		tft_Write_32(SPI_32(x, x));
#endif

		DC_C;

		addr_col = x;
	}

	// No need to send y if it has not changed (speeds things up)
	if (addr_row != y) {

		tft_Write_8(TFT_PASET);

		DC_D;

#if defined (RPI_ILI9486_DRIVER)
			uint8_t yb[] = { 0, (uint8_t) (y>>8), 0, (uint8_t) (y>>0), 0, (uint8_t) (y>>8), 0, (uint8_t) (y>>0), };
			spi.writePattern(&yb[0], 8, 1);
		#else
		tft_Write_32(SPI_32(y, y));
#endif

		DC_C;

		addr_row = y;
	}

	tft_Write_8(TFT_RAMWR);

	DC_D;

	tft_Write_16(color);

	spi_end();
//		SPIEndWrite();
//	} else {
//		PrintError("[]Error: SPI is buisy!");
//	}

}
#endif
#endif

/***************************************************************************************
 ** Function name:           pushColor
 ** Description:             push a single pixel
 ***************************************************************************************/
void Screen::pushColor(uint16_t color) {
	/*	if (SPIStartWrite()) {
	 tft_Write_16(color);
	 SPIEndWrite();
	 } else {
	 PrintError("[]Error: SPI is buisy!");
	 }
	 */
	spi_begin();

	tft_Write_16(color);

	spi_end();
}

/***************************************************************************************
 ** Function name:           pushColor
 ** Description:             push a single color to "len" pixels
 ***************************************************************************************/
void Screen::pushColor(uint16_t color, uint32_t len) {
	if (SPIStartWrite()) {

#ifdef RPI_WRITE_STROBE
		  uint8_t colorBin[] = { (uint8_t) (color >> 8), (uint8_t) color };
		  if(len) spi.writePattern(&colorBin[0], 2, 1); len--;
		  while(len--) {WR_L; WR_H;}
		#else
#if defined (ESP32_PARALLEL)
			while (len--) {tft_Write_16(color);}
		  #else
		writeBlock(color, len);
#endif
#endif

		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}

/***************************************************************************************
 ** Function name:           SPIStartWrite
 ** Description:             begin transaction with CS low, MUST later call SPIEndWrite
 ***************************************************************************************/
bool Screen::SPIStartWrite(void) {
	if (!inTransaction) {
		spi_begin();
		inTransaction = true;
		return true;
	} else {
		return false;
	}
}

/***************************************************************************************
 ** Function name:           SPIEndWrite
 ** Description:             end transaction with CS high
 ***************************************************************************************/
void Screen::SPIEndWrite(void) {
	if (inTransaction) {
		inTransaction = false;
		spi_end();
	}
}

/***************************************************************************************
 ** Function name:           SPIStartRead
 ** Description:             begin transaction with CS low, MUST later call SPIEndRead
 ** 							(set spi_speed to read)
 ***************************************************************************************/
bool Screen::SPIStartRead(void) {
	if (!inTransaction) {
		spi_begin_read();
		inTransaction = true;
		return true;
	} else {
		return false;
	}
}

/***************************************************************************************
 ** Function name:           SPIEndRead
 ** Description:             end transaction with CS high
 ** 							(revert spi_speed to write)
 ***************************************************************************************/
void Screen::SPIEndRead(void) {
	if (inTransaction) {
		inTransaction = false;
		spi_end_read();
	}
}

/***************************************************************************************
 ** Function name:           writeColor (use SPIStartWrite() and SPIEndWrite() before & after)
 ** Description:             raw write of "len" pixels avoiding transaction check
 ***************************************************************************************/
void Screen::writeColor(uint16_t color, uint32_t len) {
#ifdef RPI_WRITE_STROBE
		  uint8_t colorBin[] = { (uint8_t) (color >> 8), (uint8_t) color };
		  if(len) spi.writePattern(&colorBin[0], 2, 1); len--;
		  while(len--) {WR_L; WR_H;}
		#else
#if defined (ESP32_PARALLEL)
			while (len--) {tft_Write_16(color);}
		  #else
	writeBlock(color, len);
#endif
#endif
}

/***************************************************************************************
 ** Function name:           pushColors
 ** Description:             push an array of pixels for 16 bit raw image drawing
 ***************************************************************************************/
// Assumed that setAddrWindow() has previously been called
void Screen::pushColors(uint8_t *data, uint32_t len) {
	if (SPIStartWrite()) {

