Lagunaxx/ESP32_SPIDisplay/ESP32_SPIDisplay.cpp
#if defined (RPI_WRITE_STROBE)
		  while ( len >=64 ) {spi.writePattern(data, 64, 1); data += 64; len -= 64; }
		  if (len) spi.writePattern(data, len, 1);
		#else
#ifdef ESP32_PARALLEL
			while (len--) {tft_Write_8(*data); data++;}
		  #elif  defined (ILI9488_DRIVER)
			uint16_t color;
			while (len>1) {color = (*data++); color |= ((*data++)<<8); tft_Write_16(color); len-=2;}
		  #else
#if (SPI_FREQUENCY == 80000000)
			  while ( len >=64 ) {spi.writePattern(data, 64, 1); data += 64; len -= 64; }
			  if (len) spi.writePattern(data, len, 1);
			#else
		spi.writeBytes(data, len);
#endif
#endif
#endif

		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}

/***************************************************************************************
 ** Function name:           pushColors
 ** Description:             push an array of pixels, for image drawing
 ***************************************************************************************/
void Screen::pushColors(uint16_t *data, uint32_t len, bool swap) {
	//spi_begin();//if (SPIStartWrite()) {

#if defined (ESP32) || defined (ILI9488_DRIVER)
#if defined (ESP32_PARALLEL) || defined (ILI9488_DRIVER)
			if (swap) while ( len-- ) {tft_Write_16(*data); data++;}
			else while ( len-- ) {tft_Write_16S(*data); data++;}
		  #else
	if (swap)
		spi.writePixels(data, len << 1);
	else
		spi.writeBytes((uint8_t*) data, len << 1);
#endif
#else

		  uint32_t color[8];

		  SPI1U1 = (255 << SPILMOSI) | (255 << SPILMISO);


		  while(len>15)
		  {

			if (swap)
			{
			  uint32_t i = 0;
			  while(i<8)
			  {
				color[i]  = (*data >> 8) | (uint16_t)(*data << 8);
				data++;
				color[i] |= ((*data >> 8) | (*data << 8)) << 16;
				data++;
				i++;
			  }
			}
			else
			{
			  memcpy(color,data,32);
			  data+=16;
			}

			len -= 16;

			// ESP8266 wait time here at 40MHz SPI is ~5.45us
			while(SPI1CMD & SPIBUSY) {}
			SPI1W0 = color[0];
			SPI1W1 = color[1];
			SPI1W2 = color[2];
			SPI1W3 = color[3];
			SPI1W4 = color[4];
			SPI1W5 = color[5];
			SPI1W6 = color[6];
			SPI1W7 = color[7];
			SPI1CMD |= SPIBUSY;
		  }

		  if(len)
		  {
			uint32_t bits = (len*16-1); // bits left to shift - 1
			if (swap)
			{
			  uint16_t* ptr = (uint16_t*)color;
			  while(len--)
			  {
				*ptr++ = (*(data) >> 8) | (uint16_t)(*(data) << 8);
				data++;
			  }
			}
			else
			{
			  memcpy(color,data,len<<1);
			}
			while(SPI1CMD & SPIBUSY) {}
			SPI1U1 = (bits << SPILMOSI) | (bits << SPILMISO);
			SPI1W0 = color[0];
			SPI1W1 = color[1];
			SPI1W2 = color[2];
			SPI1W3 = color[3];
			SPI1W4 = color[4];
			SPI1W5 = color[5];
			SPI1W6 = color[6];
			SPI1W7 = color[7];
			SPI1CMD |= SPIBUSY;
		  }

		  while(SPI1CMD & SPIBUSY) {}

		#endif

	//spi_end();
	/*SPIEndWrite();
	 } else {
	 PrintError("[]Error: SPI is buisy!");
	 }
	 */
}

/***************************************************************************************
 ** Function name:           drawLine
 ** Description:             draw a line between 2 arbitrary points
 ***************************************************************************************/
// Bresenham's algorithm - thx wikipedia - speed enhanced by Bodmer to use
// an efficient FastH/V Line draw routine for line segments of 2 pixels or more
#if defined (RPI_ILI9486_DRIVER) || defined (ESP32) || defined (RPI_WRITE_STROBE) || defined (HX8357D_DRIVER) || defined (ILI9488_DRIVER)

void Screen::drawLine(T_DispCoords x0, T_DispCoords y0, T_DispCoords x1,
		T_DispCoords y1, uint32_t color) {

	if (SPIStartWrite()) {

		boolean steep = abs(y1 - y0) > abs(x1 - x0);
		if (steep) {
			swap_coord(x0, y0);
			swap_coord(x1, y1);
		}

		if (x0 > x1) {
			swap_coord(x0, x1);
			swap_coord(y0, y1);
		}

		int32_t dx = x1 - x0, dy = abs(y1 - y0);
		;

		int32_t err = dx >> 1, ystep = -1, xs = x0, dlen = 0;

		if (y0 < y1)
			ystep = 1;

		// Split into steep and not steep for FastH/V separation
		if (steep) {
			for (; x0 <= x1; x0++) {
				dlen++;
				err -= dy;
				if (err < 0) {
					err += dx;
					if (dlen == 1)
						drawPixel(y0, xs, color);
					else
						drawFastVLine(y0, xs, dlen, color);
					dlen = 0;
					y0 += ystep;
					xs = x0 + 1;
				}
			}
			if (dlen)
				drawFastVLine(y0, xs, dlen, color);
		} else {
			for (; x0 <= x1; x0++) {
				dlen++;
				err -= dy;
				if (err < 0) {
					err += dx;
					if (dlen == 1)
						drawPixel(xs, y0, color);
					else
						drawFastHLine(xs, y0, dlen, color);
					dlen = 0;
					y0 += ystep;
					xs = x0 + 1;
				}
			}
			if (dlen)
				drawFastHLine(xs, y0, dlen, color);
		}
		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}

#else

		// This is a weeny bit faster
		void Screen::drawLine(T_DispCoords x0, T_DispCoords y0, T_DispCoords x1, T_DispCoords y1, uint32_t color)
		{

		  boolean steep = abs(y1 - y0) > abs(x1 - x0);

		  if (steep) {
			swap_coord(x0, y0);
			swap_coord(x1, y1);
		  }

		  if (x0 > x1) {
			swap_coord(x0, x1);
			swap_coord(y0, y1);
		  }

		  if (x1 < 0) return;

		  int16_t dx, dy;
		  dx = x1 - x0;
		  dy = abs(y1 - y0);

		  int16_t err = dx / 2;
		  int8_t ystep = (y0 < y1) ? 1 : (-1);

		  if(SPIStartWrite()){

		  int16_t swapped_color = (color >> 8) | (color << 8);

		  if (steep)  // y increments every iteration (y0 is x-axis, and x0 is y-axis)
		  {
			if (x1 >= (int32_t)_height) x1 = _height - 1;

			for (; x0 <= x1; x0++) {
			  if ((x0 >= 0) && (y0 >= 0) && (y0 < _width)) break;
			  err -= dy;
			  if (err < 0) {
				err += dx;
				y0 += ystep;
			  }
			}

			if (x0 > x1) {
				SPIEndWrite();
				return;}
			}

			setWindow(y0, x0, y0, _height);
			SPI1W0 = swapped_color;
			for (; x0 <= x1; x0++) {
			  while(SPI1CMD & SPIBUSY) {}
			  SPI1CMD |= SPIBUSY;

			  err -= dy;
			  if (err < 0) {
				y0 += ystep;
				if ((y0 < 0) || (y0 >= _width)) break;
				err += dx;
				while(SPI1CMD & SPIBUSY) {}
				setWindow(y0, x0+1, y0, _height);
				SPI1W0 = swapped_color;
			  }
			}
		  }
		  else    // x increments every iteration (x0 is x-axis, and y0 is y-axis)
		  {
			if (x1 >= _width) x1 = _width - 1;

			for (; x0 <= x1; x0++) {
			  if ((x0 >= 0) && (y0 >= 0) && (y0 < (int32_t)_height)) break;
			  err -= dy;
			  if (err < 0) {
				  err += dx;
				  y0 += ystep;
			  }
			}

			if (x0 > x1) {
				SPIEndWrite();
				return;}

			setWindow(x0, y0, _width, y0);
			SPI1W0 = swapped_color;
			for (; x0 <= x1; x0++) {
			  while(SPI1CMD & SPIBUSY) {}
			  SPI1CMD |= SPIBUSY;

			  err -= dy;
			  if (err < 0) {
				y0 += ystep;
				if ((y0 < 0) || (y0 >= (int32_t)_height)) break;
				err += dx;
				while(SPI1CMD & SPIBUSY) {}
				setWindow(x0+1, y0, _width, y0);
				SPI1W0 = swapped_color;
			  }
			}
		  }

		  while(SPI1CMD & SPIBUSY) {}

		  SPIEndWrite();
			}else{
				PrintError("[]Error: SPI is buisy!");
			}

